#### Terraform Plan ✅
```
module.talos.talos_image_factory_schematic.this: Refreshing state... [id=d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba]
module.talos.talos_machine_secrets.machine_secrets: Refreshing state... [id=machine_secrets]
module.talos.data.talos_image_factory_urls.this: Reading...
module.talos.data.talos_image_factory_urls.this: Read complete after 0s
module.talos.data.talos_client_configuration.talosconfig: Reading...
module.talos.data.talos_machine_configuration.machineconfig_cp: Reading...
module.talos.data.talos_client_configuration.talosconfig: Read complete after 0s [id=cluster01]
module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image: Refreshing state... [id=local:iso/talos-v1.11.5-nocloud-amd64.img]
module.talos.data.talos_machine_configuration.machineconfig_worker: Reading...
module.talos.data.talos_machine_configuration.machineconfig_cp: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_worker: Read complete after 0s [id=cluster01]
module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"]: Refreshing state... [id=101]
module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"]: Refreshing state... [id=102]
module.talos.talos_machine_configuration_apply.worker_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_configuration_apply.cp_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.data.talos_cluster_health.health: Reading...
module.talos.talos_machine_bootstrap.bootstrap: Refreshing state... [id=machine_bootstrap]
module.talos.data.talos_cluster_health.health: Read complete after 1s [id=cluster_health]
module.talos.talos_cluster_kubeconfig.kubeconfig: Refreshing state... [id=cluster01]
module.traefik.tls_private_key.ubuntu_container_key: Refreshing state... [id=0940bdcfb1f2130a3129ccae2ec89db43fb78626]
module.traefik.random_password.ubuntu_container_password: Refreshing state... [id=none]
module.proxmox_csi_plugin.proxmox_virtual_environment_role.csi: Refreshing state... [id=CSI]
module.traefik.proxmox_virtual_environment_download_file.latest_ubuntu_20_focal_lxc_img: Refreshing state... [id=local:vztmpl/ubuntu-20.04-standard_20.04-1_amd64.tar.gz]
module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin: Refreshing state... [id=proxmox-csi-plugin]
module.sealed-secrets.helm_release.sealed_secrets: Refreshing state... [id=sealed-secrets-controller]
module.sealed-secrets.kubernetes_namespace.sealed-secrets: Refreshing state... [id=sealed-secrets]
module.proxmox_csi_plugin.kubernetes_namespace.csi-proxmox: Refreshing state... [id=csi-proxmox]
module.monitoring.kubernetes_namespace.monitoring: Refreshing state... [id=monitoring]
module.proxmox_csi_plugin.proxmox_virtual_environment_user.kubernetes-csi: Refreshing state... [id=kubernetes-csi@pve]
module.proxmox_csi_plugin.proxmox_virtual_environment_user_token.kubernetes-csi-token: Refreshing state... [id=kubernetes-csi@pve!csi]
module.sealed-secrets.kubernetes_secret.sealed-secrets-key: Refreshing state... [id=sealed-secrets/sealed-secrets-bootstrap-key]
module.proxmox_csi_plugin.kubernetes_secret.proxmox-csi-plugin: Refreshing state... [id=csi-proxmox/proxmox-csi-plugin]
module.traefik.proxmox_virtual_environment_container.traefik: Refreshing state... [id=108]
module.traefik.null_resource.traefik_config_sync: Refreshing state... [id=5270107476464041658]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image will be destroyed
  # (because resource uses count or for_each)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "gz" -> null
      - file_name               = "talos-v1.11.5-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-v1.11.5-nocloud-amd64.img" -> null
      - node_name               = "pve01" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 4453302272 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba/v1.11.5/nocloud-amd64.raw.gz" -> null
      - verify                  = true -> null
    }

  # module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image["pve01"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "gz"
      + file_name               = "talos-v1.11.5-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "pve01"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba/v1.11.5/nocloud-amd64.raw.gz"
      + verify                  = true
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_cp" {
      ~ boot_order                           = [
          - "virtio0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "101" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "192.168.1.210",
            ],
          - [],
          - [
              - "10.244.1.194",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fd8e:5b31:ecd1:a60b:be24:11ff:fe9c:2bfe",
              - "fe80::be24:11ff:fe9c:2bfe",
            ],
          - [
              - "fe80::982c:68ff:fee3:5fd7",
            ],
          - [
              - "fe80::5463:8ff:fea2:87a2",
            ],
          - [
              - "fe80::9443:f5ff:fe9f:1eaf",
            ],
          - [
              - "fe80::f0d6:f4ff:fe12:f6f5",
            ],
          - [
              - "fe80::bceb:faff:fe04:1c48",
            ],
          - [
              - "fe80::9858:86ff:fe47:20cb",
            ],
          - [
              - "fe80::4098:f4ff:feb9:60e1",
            ],
          - [
              - "fe80::f82a:d5ff:fe31:a48",
            ],
          - [
              - "fe80::149c:e1ff:fe47:c5b1",
            ],
          - [
              - "fe80::e021:a8ff:fe30:b2ca",
            ],
          - [
              - "fe80::387f:79ff:fe3b:203",
            ],
          - [
              - "fe80::ac54:1ff:fe81:ac7d",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "6A:E3:C5:D0:6E:5E",
          - "5A:E1:00:65:27:5B",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:9C:2B:FE",
          - "9A:2C:68:E3:5F:D7",
          - "56:63:08:A2:87:A2",
          - "96:43:F5:9F:1E:AF",
          - "F2:D6:F4:12:F6:F5",
          - "BE:EB:FA:04:1C:48",
          - "9A:58:86:47:20:CB",
          - "42:98:F4:B9:60:E1",
          - "FA:2A:D5:31:0A:48",
          - "16:9C:E1:47:C5:B1",
          - "E2:21:A8:30:B2:CA",
          - "3A:7F:79:3B:02:03",
          - "AE:54:01:81:AC:7D",
        ] -> (known after apply)
        name                                 = "talos-cp-01"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc2b59a7e2804c",
          - "lxc_health",
          - "lxc81d111c3ef70",
          - "lxc0857903ef139",
          - "lxcce5263ed994b",
          - "lxc3d5327db2c66",
          - "lxca131c7c6e46f",
          - "lxcfc77c560c53c",
          - "lxc64398a81740c",
        ] -> (known after apply)
        tags                                 = [
            "terraform",
        ]
      ~ vm_id                                = 101 -> (known after apply)
        # (28 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 100 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-v1.11.5-nocloud-amd64.img" -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-101-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + file_format          = (known after apply)
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:9C:2B:FE" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_workers" {
      ~ boot_order                           = [
          - "virtio0",
          - "net0",
        ] -> (known after apply)
      + hotplug                              = (known after apply)
      ~ id                                   = "102" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "192.168.1.211",
            ],
          - [],
          - [
              - "10.244.0.187",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fd8e:5b31:ecd1:a60b:be24:11ff:fe4f:af80",
              - "fe80::be24:11ff:fe4f:af80",
            ],
          - [
              - "fe80::b4e9:6fff:fef0:8866",
            ],
          - [
              - "fe80::7461:efff:fef0:ed5b",
            ],
          - [
              - "fe80::fc96:89ff:fe29:698d",
            ],
          - [
              - "fe80::54cd:b8ff:fe29:6988",
            ],
          - [
              - "fe80::3062:abff:fe05:6679",
            ],
          - [
              - "fe80::789a:18ff:fe17:8c78",
            ],
          - [
              - "fe80::4005:5ff:fe6b:b262",
            ],
          - [
              - "fe80::f4f9:43ff:fe55:ba0d",
            ],
          - [
              - "fe80::b83a:b6ff:fe12:a752",
            ],
          - [
              - "fe80::6c02:8dff:fe3e:bf7e",
            ],
          - [
              - "fe80::6813:1fff:fef0:120",
            ],
          - [
              - "fe80::88f0:3fff:fedf:ae50",
            ],
          - [
              - "fe80::94fa:cbff:feba:9936",
            ],
          - [
              - "fe80::180a:bcff:feb3:113f",
            ],
          - [
              - "fe80::2c6e:e8ff:fe07:92c1",
            ],
          - [
              - "fe80::78e5:b7ff:fe23:ecb8",
            ],
          - [
              - "fe80::6011:a3ff:fe06:558",
            ],
          - [
              - "fe80::cc4:3ff:fe8c:1ebe",
            ],
          - [
              - "fe80::707c:2fff:feb3:b417",
            ],
          - [
              - "fe80::fca8:ebff:fe16:f8",
            ],
          - [
              - "fe80::98e6:65ff:fef2:12a6",
            ],
          - [
              - "fe80::dc6d:15ff:fe57:8ad2",
            ],
          - [
              - "fe80::c04f:58ff:fe40:fe4e",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "9A:C8:A3:95:A7:D2",
          - "82:2D:22:B7:84:A3",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:4F:AF:80",
          - "B6:E9:6F:F0:88:66",
          - "76:61:EF:F0:ED:5B",
          - "FE:96:89:29:69:8D",
          - "56:CD:B8:29:69:88",
          - "32:62:AB:05:66:79",
          - "7A:9A:18:17:8C:78",
          - "42:05:05:6B:B2:62",
          - "F6:F9:43:55:BA:0D",
          - "BA:3A:B6:12:A7:52",
          - "6E:02:8D:3E:BF:7E",
          - "6A:13:1F:F0:01:20",
          - "8A:F0:3F:DF:AE:50",
          - "96:FA:CB:BA:99:36",
          - "1A:0A:BC:B3:11:3F",
          - "2E:6E:E8:07:92:C1",
          - "7A:E5:B7:23:EC:B8",
          - "62:11:A3:06:05:58",
          - "0E:C4:03:8C:1E:BE",
          - "72:7C:2F:B3:B4:17",
          - "FE:A8:EB:16:00:F8",
          - "9A:E6:65:F2:12:A6",
          - "DE:6D:15:57:8A:D2",
          - "C2:4F:58:40:FE:4E",
        ] -> (known after apply)
        name                                 = "talos-worker-01"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc4c3610359f1e",
          - "lxc89440711391f",
          - "lxc1c512602f594",
          - "lxcf5470bc898a0",
          - "lxcdff94f0ff71b",
          - "lxc913743c8816b",
          - "lxcf6ef1e049105",
          - "lxc4d9a8508aa0d",
          - "lxc8f860ac5c859",
          - "lxc307ecdfdf140",
          - "lxc6f9e95a792b0",
          - "lxc73ddf43ab095",
          - "lxca984ff327c96",
          - "lxc71031af599c3",
          - "lxcd92b08273928",
          - "lxc28e2afddda9a",
          - "lxcf05069ae088e",
          - "lxc3adac225e9d1",
          - "lxcf5a5794a2e4b",
        ] -> (known after apply)
        tags                                 = [
            "terraform",
        ]
      ~ vm_id                                = 102 -> (known after apply)
        # (28 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 100 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-v1.11.5-nocloud-amd64.img" -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-102-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + file_format          = (known after apply)
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:4F:AF:80" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Warning: Deprecated Resource

  with module.monitoring.kubernetes_namespace.monitoring,
  on modules/monitoring/main.tf line 2, in resource "kubernetes_namespace" "monitoring":
   2: resource "kubernetes_namespace" "monitoring" {

Deprecated; use kubernetes_namespace_v1.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Triggered by @ravilushqa*